
#!/bin/bash

if [ -z "$1" ]; then
    echo "用法: $0 <股票代码>"
    exit 1
fi

#@ fix MARKET to fit east_money!!
MARKET=${1:0:1}; [[ $MARKET -eq 0 ]] && MARKET=1 || MARKET=0
CODE=${1:1}
DATE=$(date +%Y-%m-%d)
TIME=$(date +%H:%M:%S)

#@ f43:     最新价
#@ f44:     最高价
#@ f45:     最低价
#@ f46:     今开价
#@ f47:     成交量
#@ f48:     成交额
#@ f49:     内盘
#@ f50:     量比
#@ f51:     涨停
#@ f52:     跌停
#@ f57:     代码
#@ f58:     名称
#@ f60:     昨收价
#@ f71:     均价
#@ f84:     总股本
#@ f85:     流通股
#@ f116:    总市值
#@ f117:    流通市值
#@ f122:    年涨幅
#@ f126:    股息率
#@ f162:    市盈率动
#@ f165:    市消率
#@ f167:    市盈率静
#@ f168:    换手率
#@ f169:    涨跌额
#@ f170:    涨跌幅
#@ f171:    振幅
#@ f173:    净资产收益率
#@ f191:    委比

API_URL="\
http://push2.eastmoney.com/api/qt/stock/get?\
ut=fa5fd1943c7b386f1734de823dee15&\
fields=f43,f44,f45,f46,f47,f48,f58,f60,f116,f117,f168,f169,f170&\
secid=${MARKET}.${CODE}\
"
response=$(curl -s "$API_URL") || exit 129

#@ from:
#@ (1)收盘价 (2)最高 (3)最低 (4)今开 (5)成交量 (6)成交额 (7)名称 (8)昨收 (9)总市值 (10)流通市值 (11)换手率 (12)涨跌额 (13)涨跌幅
#@ 
#@ to:
#@ (1)日期 (2)代码 (3)名称 (4)收盘价 (5)最高 (6)最低 (7)今开 (8)昨收 (9)涨跌额 (10)涨跌幅 (11)换手率 (12)成交量 (13)成交额 (14)总市值 (15)流通市值 (16)成交笔数 (17)时间
echo "$response"                                            \
    | sed 's/{.*{\|}.*}//g; s/"[^"]*"://g; s/,\|"/ /g;'     \
    | awk -v date=$DATE -v time=$TIME -v code=\'$CODE       \
      '
        BEGIN { CONVFMT="%.2f"; OFMT="%.2f"; }
        { print date, code, $7, $1/100, $2/100, $3/100, $4/100, $8/100, $12/100, $13/100, $11/100, $5, $6/1000, $9/1, $10/1, "0", time; }
        #        1      2    3     4      5        6       7       8        9       10       11    12    13     14     15    16   17
      '


