#! /bin/bash

[[ ${#1} -ne 7 ]] && { echo -en "** code must have 7 digitals!! \n" >&2; exit -1; }

#http://hq.sinajs.cn/list=sh600151,sz000830,s_sh000001,s_sz399001,s_sz399106,s_sz399107,s_sz399108,sz002230
#var hq_str_sh600151="航天机电,8.040,8.030,7.920,8.040,7.890,7.920,7.930,5309239,42224730.000,33600,7.920,103461,7.910,137000,7.900,77400,7.890,98000,7.880,50800,7.930,45000,7.940,24700,7.950,47004,7.960,21000,7.970,2017-12-15,10:41:25,00";
#注：
#上证指数（指数名称）,2289.791（当前点数）,-16.065（涨跌额）,-0.70（涨跌幅度）,599419（总手）,5529858（成交金额）";
#1 "航天机电,名称
#2 7.08,今开
#3 7.09,昨收
#4 6.95,当前
#5 7.08,今日最高
#6 6.90,今日最低
#7 6.95,竞买价，即买一报价
#8 6.96,竞卖价，即卖一报价
#9 4368014,成交的股票数量，应除以100
#10 30484831,成交金额，单位为元
#11 2900 买一申请股数（29手），
#12 6.95  买一报价
#13 5700 买二申请
#14 6.94  买二报价
#15 11688  买三申请，
#166.93  买三报价  
#17 19700  买四申请，
#18 6.92  买四报价  
#19 28200  买五申请，
#20 6.91  买五报价  
#21 700  卖一申请，
#22 6.96  卖一报价  
#23 6000  卖二申请，
#24 6.97  卖二报价  
#25 26600  卖三申请，
#26 6.98  卖三报价  
#27 21701  卖四申请，
#28 6.99  卖四报价  
#29 104259  卖五申请，
#30 7.00  卖五报价  
#31 2012-06-12  日期  
#32 15:03:05 时间  


[[ ${1:0:1} == 0 ]] && _codeSina=sh${1:1} || _codeSina=sz${1:1}


#@ output:
#@ (1)日期 (2)代码 (3)名称 (4)收盘价 (5)最高 (6)最低 (7)今开 (8)昨收 (9)涨跌额 (10)涨跌幅 (11)换手率 (12)成交量 (13)成交额 (14)总市值 (15)流通市值 (16)成交笔数 (17)时间
curl -f http://hq.sinajs.cn/list=${_codeSina} 2>/dev/null   \
    | iconv -f GBK -t utf8  \
    | sed -n 's/ //g;s/^.*="//;s/"\;$//;s/,/ /g;p'  \
    | awk '{ print $31,"'\'${1:1}'",$1,$4,$5,$6,$2,$3,$4-$3,100.0*($4-$3)/$3,0,$9,$10,0,0,0,$32 }'

